feat: prompt engineering
